[
    {
        "content": "That's right folks, after four long months I have finally been able to work on this sub. No longer will you need to be on an approved users list. Feel free to post all you want but make sure to keep our rules in mind. Also feel free to check out our brand new sister sub r/fictiontime a fun collaborative creative writing subreddit run by the mod team of r/storytime! Have fun sharing your stories with all you fellow story timers!",
        "id": 0,
        "post_id": "hi6d2j",
        "title": "UPDATE: r/storytime is now a public sub! Make sure to check out our brand new sister sub r/fictiontime"
    },
    {
        "content": "Context: My dog is a 9yr old Chihuahua. In my household I speak Vietnames and English. I have taught my dogs tricks in only english and he sometimes understand some vietnames words but to my knowledge he dose not know vietnames. My dog has also had this limp one of his back legs for almost all of his life, it was very small and I have taken him to the vet multiple times but nothing has changed, he would just occasionally lift his leg up a bit but could still walk normally.\n\nStory: After a trip back from Thailand, I saw that my dog was limping more than usual and would sometimes walk on only 3 legs. So after 3 days like this I took him to the vet for a checkup. In the car I am talking with my mom in Vietnames saying that he should also get his worm injection as well when he is there and maybe the vet can give him some type of other injection for his leg. When me and my mom were taking about the injection he kept looking at us very weird. So when we get there I tell the vet the problem and put him on the ground to show his limping. \n\nI proceed to run around the room for my dog to follow me and this little shit walks perfectly fine, not even a light leg lift, he's even running around. So the doctor just gave me some bone strengthening medicine and I left. As soon as I put my dog back in the car his leg goes straight up and now apparently starts limping again. I am now convinced my dog can understand vietnames and didn't want an injection and so he faked being healthy to get away scot free.\n\nTLDR:My dog was limping took him to the vet, in the car on the way there, I spoke vietnames with my mom about giving him an injection. When we get there he could suddenly walk perfectly fine. Took him home and starts limping again. Am now convinced he knows vietnames and faked being ok so that he didn't get an injection.",
        "id": 1,
        "post_id": "108c45t",
        "title": "My dog faked being healthy when I took him to the vet"
    }
]