[
    {
        "content": "That's right folks, after four long months I have finally been able to work on this sub. No longer will you need to be on an approved users list. Feel free to post all you want but make sure to keep our rules in mind. Also feel free to check out our brand new sister sub r/fictiontime a fun collaborative creative writing subreddit run by the mod team of r/storytime! Have fun sharing your stories with all you fellow story timers!",
        "id": 0,
        "post_id": "hi6d2j",
        "title": "UPDATE: r/storytime is now a public sub! Make sure to check out our brand new sister sub r/fictiontime"
    },
    {
        "content": "I'm (15 f) so boring, like I have no features that makee pretty or ugly I'm just boring, like I hate how I'm so mid, there's nothing for you to say I'm ugly but I'm definitely not getting called pretty. I'm just hoping that I can grow into myself or whatever but for now I will hate my appearance and how boring and dull it is. I just want to feel pretty but I can't without makeup and then it's off and I hide my face from mirrors. I've struggled with body dysmorphia but now idk if that is just it hard to imagine someone so plain",
        "id": 1,
        "post_id": "10a5g0j",
        "title": "I hate my appearance"
    },
    {
        "content": "I’m a pretty even-keeled person, but occasionally I can’t just let things go when I hear pure lunacy coming from some peoples mouths and the voice in my head suddenly appears in my mouth. \n\nOne morning recently ended up being one of those times when I had a conversation (for lack of a better word) with a young, self-described “Intellectual”.\n\nI had breakfast a restaurant near a local university and overheard the group of college-aged girls (by college age I’m saying they were probably freshmen…maybe sophomores) in the next booth discussing “the state of the world”. \n\nIt was quite humorous, until one of the girls started discussing her preference for Socialism. I did manage to keep my internal voice internal through most of it……..until……..\n\nUntil she said, “I think it’s time for us Intellectuals to take over and teach these uneducated cretins. We have to make fundamental changes to the way this country is run. Our form of government just doesn’t work.”\n\nThis definitely got my attention.\n\nShe continued, “they just don’t understand how Socialism works. Capitalism is a failed system where the rich people take advantage of the working class and just keep getting richer. A Socialist society would benefit everyone, not just the rich.”\n\nMind you…from a quick perusal of the way this girl was dressed, she was NOT poor. Nor was she “working class”. She was wearing some very high-end designer clothing and jewelry to match. But I digress.\n\nThis is when my “oops, did I say that out loud?” moment came.\n\nI said (before I could stop myself), “for an intellectual, you don’t seem to know a lot about the history of Socialist governments. As an ‘intellectual’ I’d think you’d be afraid of a move to a Socialist government.”\n\nShe (and all three friends) turned and looked at me like I was a leper who’d just plopped down next to them. After a moment of looking down her nose at me, she said (in a voice absolutely dripping in indignation), “What?”\n\nI said, “Well, in all the societies where fundamental changes in a society’s philosophy are made, the Intelligentsia are some of the first people rounded up and purged.”\n\nFrom the looks on their faces I could tell they were completely lost. Finally, she repeated (still dripping with indignation), “What?”\n\nIn for a penny, in for a pound, as they say…”The Intelligentsia…you know…the ‘Intellectuals’ (yes, I did finger quotes…sue me)…the change from Lennon to Stalinist Russia…the communist takeover of China, Vietnam and Korea…the Islamic takeover of Iran…the Taliban takeover of Afghanistan…the Socialist takeover of Venezuela…all of them saw significant purges of “undesirables”, including the “Intellectuals”.\n\nShe responded, “That wouldn’t happen here. The United States isn’t like those countries.”\n\nAnd I said, “No…it’s not…except YOU want to change the United States into something it’s not…to be like those other countries…to be a place where things like that CAN happen.”\n\nShe was stunned for a moment, then got a smug look on her face and said to her friends, “A prime example of the type of uneducated cretin I was talking about.”\n\nThen she looked back at me and said, “Okay Boomer, whatever you say. Just keep believing everything you see on Fox News.”\n\nYep…the inevitable “Okay Boomer”…I’m guessing she thought saying that proved her superiority and would send me crying into the corner in the fetal position.\n\nShe’s never met me…until now…\n\nI responded, “They say, ‘Those who know the least want to be heard the most.’ This is clearly the case here. Since I have two earned doctorates and a whole lifetime of real-world experience, I’d venture a guess that I’m significantly more educated than you are. Whoever poured that glass of Koolaid for you must have made it especially sweet.”\n\n(She clearly did not understand that last part based on the confused look in her eyes)\n\nI continued, “I honestly feel sorry for you. You seem to have a good brain in your head. You’re well-spoken and probably have a lot of potential, but you’ve chosen to simply parrot what some teacher or professor filled your head with rather than thinking for yourself and doing a little research on the subject. It’s sad, really.”\n\nStunned silence from all four.\n\nI then noticed that my waitress was standing there with my bill, which I took and started to leave. As I stood to leave, the girl finally saw her chance at one more parting blow and said, “What-EVER, Boomer.”\n\nDon’t you just love it?\n\nYeah…I probably could have just stayed quiet…but you know me…I’m just an uneducated cretin.",
        "id": 2,
        "post_id": "10aap1r",
        "title": "My run-in with a “pseudo-intellectual”"
    },
    {
        "content": "My whole life my father has been weird and secretive. He restricted my eating whenever I was at his house. I was constantly weighed and verbally abused. He treated me like a soldier or something. I don’t know his real name, age, or birthday. I found out about two years ago he came here illegally and had been lying about my race. That’s just a little background. I looked him up on ccap, just like Wisconsin public records. He was in jail for domestic abuse. I read the comments it said the mother was someone I hadn’t heard of. She wanted to break the no contact order for the birth of this child. Oh and you wouldn’t believe who bailed him out, my step mom bailed him out of jail for beating a woman who’s pregnant with his child. I asked my step mom about the child she claimed “it didn’t make it”. I asked my mom if she knew the woman and turns out my step dad cheated on my mom with the lady, in her own bed! My mom obviously wanted nothing to do with the lady. I found her on facebook and sent her a message. She told me he is alive and he’s in middle school. Unfortunately she got all her children taken away so she can’t even tell me anything about him. After that she just started telling me how terrible my father is and what he did to her. That made me uncomfortable. I don’t speak to him, I know he’s not a good man but that was just too much to hear. So i’ve heard way more than I needed and still only know the boys first name.",
        "id": 3,
        "post_id": "10a4exx",
        "title": "What is my life?"
    },
    {
        "content": "I M-18 had always been a non believer of fate but something change ever since an event in school happened. In my school, there is always an event in which we compete in a mr and ms With other schools so that is the night where it started. My classmate F-18 lets call her hazel, have known each other since elementary because we were classmates since then but i never really noticed her, like i know that she is a classmate but I've never really interacted with her atleast not until that night. So what happened was we were so tired and we sat in a really long chair and after that we slowly get closer to each other until we were touching and that is the first time i got shy. The next day we started chatting normally and when we get to sit next to each other we always never leave and just stay next to each other without talking or anything, the only mistake that i did was I confessed in chat out of shyness and after that i got blocked and never talked to her again. I was ready to move on until one day i was browsing my family pictures and a piece of paper accidentally fell in the cabinet, it was a paper with her handwritten name and until now i still don't know how that happened. She never ever went to my house and the paper ended up at my family pictures cabinet which rarely get opened. After that i couldn't get her off my mind and I always see a car that is exactly as the car she always ride on her way to school. At the Christmas party she was the one who picked my name randomly and she got me a gift.  And the last coincidence is this, but before i say this let me just be clear we are not related because our hometowns are too far and we don't have any family near our place right now, i happened to ask my dad's old middle name and to my surprise it was the same as her last name. Up until now i still don't know if this is a coincidence or not.",
        "id": 4,
        "post_id": "1091nis",
        "title": "what's the greatest coincidence that made u believe in fate?"
    },
    {
        "content": "Just for some context I’m a junior and this is my first real year of high school after Covid and all that fun stuff. Being an upperclassman, I’ve learned that it’s in our nature every year to make fun of the freshmen. Everything bad that happens gets blamed on the freshmen and every stupid thing that they do is just a product of them being freshmen. I’m not gonna lie, me and some of my friends took the freshmen slander a little far. I didn’t think it was too bad, but I didn’t know that I’d be paying for it later on. For some more context I’m hopelessly lonely. Over the summer heading into this year, I wanted to change that so I had a massive glow up. I mean, I was pretty good looking. I thought this year was going to be different. Over the course of this year I’ve noticed a pattern. I seem to only attract freshmen. I’ve let them know that I am not comfortable with the age gap countless times, but they remain set on me as some final goal or something. Girls my age show almost little to no interest, but I have a new freshman dming me or adding me almost every day. There have been too many instances for this to be a fluke. I probably have about 25+ freshmen girls who have hit on me this year and this isn’t even limited to my own school. I wonder if the universe has like cursed me or something because I was being too hard on them. Whatever the reason, I’ve had little to no success in sustaining relationships with girls my own age and it’s eating me alive. This absolutely sucks.",
        "id": 5,
        "post_id": "108xw6a",
        "title": "I Think I’ve been cursed by the Universe…"
    },
    {
        "content": "To start, my dad came in my room after smelling like sweat and asked if I can crack his back. So, I told him he smelled like sweat and he called me rude and almost hit me for it. After that he made me crack his back. \n\nBut, the think is weeks before that my dad told me I smelled like sweat. He didn’t even say it nicely. He screamed, “you smelled like shit” at my face several times before grabbing my arm to make me put deodorant on. I told him that was rude and he then proceed to ask me, “if I like people knowing I smell like shit” \n\nSo when I told him he smelled like sweat in a nicer way I thought he would appreciate it because of how harsh he was on me for smelling that way. \n\nBut was I in the wrong here?",
        "id": 6,
        "post_id": "108sgv5",
        "title": "Am I wrong for telling my dad he smelled like sweat?"
    }
]