[
    {
        "content": "That's right folks, after four long months I have finally been able to work on this sub. No longer will you need to be on an approved users list. Feel free to post all you want but make sure to keep our rules in mind. Also feel free to check out our brand new sister sub r/fictiontime a fun collaborative creative writing subreddit run by the mod team of r/storytime! Have fun sharing your stories with all you fellow story timers!",
        "id": 0,
        "post_id": "hi6d2j",
        "title": "UPDATE: r/storytime is now a public sub! Make sure to check out our brand new sister sub r/fictiontime"
    },
    {
        "content": "*(Sorry for the typos and language mistakes, English is not my first language)*\n\n*My storry is probobly a little long, i hope that is fine, there will be some details that is not nesseserry to share but i will anyway.*\n\nJust a setting explanation and a bit of background.\n\nI am 19 years old and have signed up for the Danish army, and am at the end of my military service. There is this final combat / patrol exercise, which is the wildest thing to experience, and it is here at the beginning that the story starts.\n\nOf course, I'm the type who can't sleep when it's necessary, so the night before the start of the exercise I may have had 2-3 hours of sleep.\n\nThe exercise starts at the military base, with an in-depth briefing of the first mission, and practicing an ambush on a logistics truck convoy we are going to do.  We also get a brief overview of CQB, as we will  come across thisfor the first time in the exercise as well.\n\nThen we are all called into a hall where we have to strip down and stand with our sleeping bags over our heads, while our group leader went through our things. (we weren't allowed to bring anything) only ouer kit and the provided MRE.) At the same time, loud techno music was playing over some speakers, it took them about an hour to search our things \\[  It was a surreal experience, and boiling hot inside the bag haha  \\]\n\nAfter we are approved, we go out to our trucks (simulated helicopters) where we are driven out to a drop zone. We then had about a 15 km walk, maybe a little more, to link up with the rest of the company. Which has established a FOB around an old truck station.\n\n^(\\[  Not important to the story but fun - When we hiked our infiltration and we felt totally sneaky our whole group ended up activating a giant motion sensor street lamp so it was  ...  bravo-6 going compleatly illuminated haha \\])\n\nArrive around 01:30AM or something like that. I am now reaching the point of 2 days with max 3 hours of sleep, I am still fine though.\n\nA short briefing and then we head out on a hike to the ambush location and set up. I have been put on the back security team so i am basically just sitting staring out into the forest making sure ouer ambush dossent get ambushed. (The territorial defense forse, / home-guard, are portraying the enemy)\n\nAt this point the least weard hallucination occurred, which is that the tall twigs all start to look like combat radio antennas and then my brain just fill out the rest and for a split second every few minuts my brain told me i saw a siluet of a solier in the dart (though i did know it was my brain playing tricks on me)\n\nAfter the ambush was finished around 05 - 06 in the morning. And we were given around 45 minutes of rest time after returning to the FOB. slept for around 20 minutes and then we were pulled out to do an observation patrol. it was daytime now and nothing really interesting happened that day.  But on day 3 of bacically no sleep my brain really started to fuck with me in the dark i constantly started to see shit out te corner of my eye (But i still knew it was my head fucking with me).\n\nIn any case, both day and night 3 pass without sleep, and when day 4 starts, my group has to have guard duty around the FOB. I chose to be on constant fence patrol because I literally fell asleep every time I sat down or stood still for more than a minute. \\[And you don't want to be caught sleeping on duty\\] (I also ended up falling asleep while walking, which is a crazy experience)\n\nOn the 4th night we had to take part in an attack against an enemy held radar station, it was wild and the closest we got to experiencing urban combat in the service. One of my team was even allowed to throw a practice grenade, even though we weren't trained for them yet. That night I hallucinated a flying baby head, I saw a fully lit armchair standing in a pitch black forest and also a lamp from my childhood a few hours later. I was constantly seeing things moving out of the corner of my eye it was fucking surreal.\n\nAfter this we are told to start walking our exfiel where we have a pickup waiting for us. We actually make it on time and there is a truck waiting for us but he has been ordered not to drive us but only to take our 30kg bags which was nice now we only have our vest and rifles to carry.\n\nFor me it was about 5 days without sleep for the others only 4. After this there was not much left about a 20 km walk home to the base and an obstacle course to be completed with a mutherfucker of a log that ouer team had to make sure diddent tuch the ground.  All in all, a wild experience and, absolutely crazy that one's brain can fuck with you so much due to lack of sleep.\n\nSorry if the storry was too long i just wanted to get alot of the details included.",
        "id": 1,
        "post_id": "10aqsb4",
        "title": "Sleep deprivation is wild."
    }
]