[
    {
        "content": "That's right folks, after four long months I have finally been able to work on this sub. No longer will you need to be on an approved users list. Feel free to post all you want but make sure to keep our rules in mind. Also feel free to check out our brand new sister sub r/fictiontime a fun collaborative creative writing subreddit run by the mod team of r/storytime! Have fun sharing your stories with all you fellow story timers!",
        "id": 0,
        "post_id": "hi6d2j",
        "title": "UPDATE: r/storytime is now a public sub! Make sure to check out our brand new sister sub r/fictiontime"
    },
    {
        "content": "Heyy . What is the unusual thing you have seen but no one believes you ?\n\nI will start. I was alone at home, I played the songs loudly and sat listening to them, but I heard a strange sound as if someone was trying to enter the house, but I didn't care and went back to listening to the song after I stopped it to check the sound. After two minutes, the sound came back, but now it was louder, as if he had managed to enter the house. And because I am not afraid, I stopped the songs again and went to check the source of the sound, but I did not find anything, so I decided to play a game with the sound: I restarted the song, but I hid behind the door, I will not lie.I saw a white shadow coming towards my room quickly, but it did not stay there because when I made a sound from behind the door, it came out of the room very quickly .",
        "id": 1,
        "post_id": "10cmlnu",
        "title": "your / my story"
    },
    {
        "content": "I think about this story often. My great uncle fought in WWII and was a rifleman. He did see combat but he never really talked about it. I know he did have confirmed kills but late in life he was bery unhealthy. He ended up in a wheelchair having both legs gone from above the knee.\n\nHe died three different times and was brought back with the defib. He was a decon in the Presbytarian Church for many years, to keep the wife \"happy.\" He was a closet athiest but his story of coming back has haunted me for thirty years. \n\nHe said that he blacked out and his wife called 911 and upon arrival his heart stopped. He doesnt remember what he was doing that triggered this or what happened but he said it was like waking up when soneone calls your name. He awoke and sat up. A quick scan saw he was in a hospital room, everything bright white sort of washed out slightly blurry. He looked to the door way and saw a nurse. She was beautiful and called his name again and gestured with her arm for him to follow.\n\nHe quickly threw off the blanket and jumped to his feet to follow her out of the room. She stayed just ahead of him barely out of reach but luring him with an outstretched arm. He was running after her down the hallway past room after room. He looks around again and sees another nurse beside him. \n\nHe looks straight ahead again and things start shifting. The blur intensifies and the walls begin to appear like they're moving. He looks back to the nuse beside him and her white gown is now blood red and she has completly white eyes and huge fangs. Her mouth is just all fangs. He is terrified and looks forward again and the first nurse has also changed and he quickly retracts his arm from trying to hold her hand.\n\nThe walls now look like he is in the esophagus of a giant beast, red fleshly walls wiggling with life and purpose. As he pulled his arm away his hand comes to a rest slightly above his head. The first nurse swipes at him with her finger nails which now look like creature paws, and takes a big chuck of flesh from his forearm. Then the second nurse joins in ripping his flesh from the bone.\n\nAll this happens in just a matter of a few seconds but as he is screaming he is revived and wakes back up in the hospital after a while he comes back home and tells me this story. He believed that this was him being lured to hell to remain imprisoned there. I asked him \"Does this make you want to live your life for God now? Do you believe in God now?\" And all he said was \"It wasn't THATBad.\"\n\nI just had to tell this story again.",
        "id": 2,
        "post_id": "10cdw0y",
        "title": "My great uncle died and came back. This is what he said he saw."
    },
    {
        "content": "So in first grade I met valen. And everything was good. Me and her were best friends, in 2nd grade valen met skrym at first I didn't like skrym i didn't trust him, I didn't end up liking him till 3rd grade when valen met camila and invited her to are group. I hated camila. Everything about her was just off. From their we had a lot of people come and go, but no one important to this story. 4th grade comes around, and by now, I have started to like camila. Me and her would have good times laughing and having fun, or so I thought. Camila was always jealous of Me and valens friend ship she hated that I was closer to valen than she was. So she started a fight with me, and everyone took her side, and I was kicked out for 2 weeks. I didn't talk to them, but then I reached out and apologized, and I never got one. Sorry from camila. They let me back in the group. I was their for about a month, then got kicked out again this time, i didn't reach out for about 2 months and took some time to myself. Eventually, I reached out and apologized again, and everything was good. i wasn't kicked out again for a while.  It's the summer before 5th grade, my mom passed away, I was a mess, I spent a lot of time talking about it, and valen was by my side and helped me get through it. Its 5th grade now and camila decided she was done with all the attention being on me and the loss of my mom, she made up a story about how her dad abused her and  how she was raped and we all supported her \"note in a few years she admitted to lying about all of this for attention\" a week after her story I was talking about my mom camila lost it and said that no one cared, that people had it worse than me, like her. Me and camila got into a fight. I was once again kicked out. At this time, I had a lot going on and was trying to greif. I didn't go back till summer before 6th grade, I went back to the group and apologized to camila and told her how sorry I was about what her dad did. From that day, I decided not to talk about my mom and that no one cared. It's 6th grade now I got kicked out once again because camila had a crush on valen and we got into a fight about it \"I didn't want them to break up and then the group fall apart\" I got kicked out for a few months then came back and apologized again. Covid hits, and I got camila kicked out after she told my sister to kill herself. Valen introduced me to Piggy, me and Piggy became friends. A month goes by, and camila is back and \"had changed.\" Online schools start I got another friend group and I told them everything that camila, valen, and skrym had put me through over the years and my new friends made me see how toxic they were and got me to leave them. It's summer before 8th grade. I stayed friends with my new group for 3 months, but they ended up being toxic as well, and I left them at this time. I also stopped being friends with piggy. I reached out to valen, and I became friends with everyone, but I made it clear I had no interest in camila. It's the middle of 8th grade. I got camila kicked  out again, and Piggy and I became friends again. Camila comes back 2 weeks later and \"changed again.\" Everything was solid. I kept my distance from her. Camila finally tells us the truth about her dad and how he never raped her or abused her. Everyone was understanding but I just pretended I was cool with it \"I thought and still think it's fucked up\" camila starts ranting to me and I listen to her and are there for her. I spent a lot of time with camila and valen at this time, \"skrym was busy with school and other friends\" I hangout with piggy time to time, it's summer before 9th grade and I have a lot of new friend groups, I dont hangout with valen or camila as much because camila was pissing me off \"I couldn't say anything about it though because I would be banished again\" camila has started to copy things I do and I could tell she was still jealous of mine and valens relationship camila started to copy my personality and laugh and small things I would do. It was just making me mad, so I needed to get away. Okay back on track, it's 9th grade I hangout with piggy mainly and with valen and camila \"skrym doesn't hangout with us a lot he hangout with other people- I don't blame him\" I met my now ex boyfriend let's call him jj for short. Me and jj hang out all the time, and when I'm not playing with jj, I'm with Piggy. I realized that camila, valen, and skrym never invited me to hang out, so I decided I would text everyone separately to hang out when everyone is available. Now everyone agreed to hangout,but camila had an issue with me, she said that I forgot about them and that everyone was talking shit about me behind my back, so I went off on everyone I was so pissed after all these years I've dealt with this. A day after this skrym and camila texted me camila said she lied that only she talked shit about me and skrym said the same thing \"it was only camila\" valen refused to talk to me, I forgave camila but valen blamed me she said she was tired of me always leaving. She didn't blame camila for spreading fake rumors but blamed me for reacting. Camila and valen stayed friends, but I was the bad guy. I was in the wrong, not camila, and valen said she wouldn't be my friend. For about a month, I stayed friends with camila. I listened to all of her problems. I listened to her blame everybody for her mistakes she wouldn't take the blame. Eventually, i was done. I went off on her, and then she ghosted me. It's December. I broke up with my boyfriend for reasons. And then I dropped camila. Skrym was being fake with me, so I dropped him too. I used to blame only camila, but Vale and skrym were just as fake and just as bad as her. Nothing I ever did was good enough. I was always the bad guy. I will always be the bad guy, and no matter what, camila will always walk away with no consequences. It just makes me so mad and sad, I wasted so much time, but camila will never take the blame, and valen will always be on her side even if it's the wrong one. So let's note so key things, I know these people online, I shortened up everything their are a lot of details left out and so much more to be said, and if anyone wants more information let me know because I have so much to say. I have years of trauma and emotional abuse from these people. I was gaslighted and manipulated for so long, and it took me till now to fully walk away.",
        "id": 3,
        "post_id": "10cgm0y",
        "title": "toxic friends"
    }
]